cskilbeck/distance_sensor/firmware/CH32V003F4P6/User/user_main.cpp
//////////////////////////////////////////////////////////////////////
//
// x    Common message stuff between ESP12 and CH32
// x    ESP12 Tasks (x WiFi, SPI etc)
// x    ESP http send
// x    Server/Database
// x    SPI Slave mode
// x    CH32 Sleep/standby for N minutes
// x    Button wakeup
// x    Handshake ESP/CH32 boot via MOSI? But.. janky current thing is working...
// x    Measure power consumption
// x    Factory reset (long button press)
// x    B2B Connector
// x    Status/history web page
// x    Enclosure
//
//      Alexa notification
//      Email notification
//
//
//////////////////////////////////////////////////////////////////////

// log printf statements

// #define DEBUG_PRINTF

// don't talk to the ESP

//#define DEBUG_NO_ESP

// ignore server sleep_count, use this instead (also makes time per sleep_count shorter - ~2 seconds instead of ~30)

// #define DEBUG_OVERRIDE_SLEEP_COUNT 2

// button press puts it to sleep

//#define DEBUG_BUTTON_SLEEP

//////////////////////////////////////////////////////////////////////

#if defined(DEBUG_PRINTF)
#include <stdio.h>
#endif

#include <memory.h>

#include <ch32v00x.h>
#include <ch32v00x_conf.h>
#include <ch32v00x_gpio.h>

#include "int_types.h"
#include "user_gpio.h"
#include "user_pins.h"
#include "crc.h"
#include "user_ch32v003.h"

#if defined(DEBUG_PRINTF)
#define debug printf
#else
#define debug(...) do {} while (false)
#endif

//////////////////////////////////////////////////////////////////////

namespace
{
    int constexpr SYS_CLOCK = 48000000;

    int constexpr MAX_VALID_DISTANCE = 40000;               // any distance reading > this is invalid
    int constexpr MAX_DISTANCE_TRIES = 3;                   // try to get a valid distance reading this many times
    int constexpr FACTORY_RESET_BUTTON_TIME_MS = 5000;      // hold button for this long to factory reset
    int constexpr ESP_POWER_OFF_TIME_MS = 250;              // power off ESP for this long when it fails to boot or send
    int constexpr ESP_CRASHED_TIMEOUT_MS = 20000;           // give ESP this long send it else reboot it
    int constexpr SLEEP_DELAY_MS = 1;                       // pause before going to sleep
    int constexpr VBAT_READ_DELAY_MS = 2;                   // pause before reading vbat
    int constexpr ESP_BOOT_TIMEOUT_MS = 5000;               // wait this long for ESP to boot after power up
    int constexpr SENSOR_BOOT_DELAY_MS = 100;               // give distance sensor this long to boot

    int constexpr DISTANCE_COUNTER_HZ = 8000000;            // distance counter Hz

    // set counter prescaler to (DISTANCE_TIMER_SCALE - 1)

    uint16 constexpr DISTANCE_TIMER_SCALE = (static_cast<uint16_t>(SYS_CLOCK / DISTANCE_COUNTER_HZ));

    static_assert((SYS_CLOCK % DISTANCE_COUNTER_HZ) == 0, "DISTANCE_COUNTER_HZ must divide exactly into SYS_CLOCK");

    enum state_t
    {
        state_factory_reset = 0,
        state_read_vbat,
        state_read_distance,
        state_wait_for_esp,
        state_esp,
        state_reboot_esp,
        state_done,
        state_num
    };

#if defined(DEBUG_PRINTF)
    char const *state_name[state_num] =
    {
        "factory_reset",
        "read_vbat",
        "read_distance",
        "wait_for_esp",
        "esp",
        "reboot_esp",
        "done"
    };
#endif

    //////////////////////////////////////////////////////////////////////
    // status of a system (spi, vbat adc etc)

    enum status_t
    {
        status_idle,
        status_in_progress,
        status_complete
    };

    //////////////////////////////////////////////////////////////////////

    struct stopwatch_t
    {
        uint32 now;

        uint32 elapsed() const;
        void reset();
    };

    //////////////////////////////////////////////////////////////////////

    struct button_t
    {
        uint16 history;
        union
        {
            struct
            {
                volatile uint16 pressed :1;
                volatile uint16 released :1;
                volatile uint16 held :1;
            };
            uint16 flags;
        };

        void update(int state);
    };

    //////////////////////////////////////////////////////////////////////

    extern "C"
    {
        void TIM1_CC_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast"))) __attribute__((used));
        void SysTick_Handler(void) __attribute__((interrupt("WCH-Interrupt-fast"))) __attribute__((used));
        void ADC1_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast"))) __attribute__((used));
        void DMA1_Channel2_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast"))) __attribute__((used));
        void DMA1_Channel3_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast"))) __attribute__((used));
    }

    void spi_start();
    void user_init();
    void init_peripherals();
    void set_state(state_t new_state);

    //////////////////////////////////////////////////////////////////////

    // main system state

    state_t state;
    stopwatch_t state_stopwatch;

    // status of some peripheral handlers

    volatile status_t vbat_status = status_idle;
    volatile status_t spi_status = status_idle;
    volatile status_t distance_status = status_idle;

    // systicks, 1KHz

    volatile uint32 ticks;

    // SPI buffers are double size - 1st half of tx and second half of rx are discarded
    // because ch32 spi is in full duplex mode but esp12 can't seem to do that, it
    // sends then receives the packet sequentially

    uint8 spi_tx_data[SPI_DATA_SIZE * 2] __attribute__ ((aligned(4)));
    uint8 spi_rx_data[SPI_DATA_SIZE * 2] __attribute__ ((aligned(4)));

    // NOTE spi data transactions are guaranteed to happen at <= 10Hz
    // so no need to copy the buffers, use in place if we're quick about it

    message_t &tx_msg = *reinterpret_cast<message_t * const >(spi_tx_data + SPI_DATA_SIZE);
    message_t const &rx_msg = *reinterpret_cast<message_t const * const >(spi_rx_data);

    ch32_reading_payload_t &payload = *reinterpret_cast<ch32_reading_payload_t *>(tx_msg.body.payload);
    esp_status_payload_t const &rx_payload = *reinterpret_cast<esp_status_payload_t const *>(rx_msg.body.payload);

    // distance sensor admin

