cskilbeck/distance_sensor/firmware/CH32V003F4P6/User/user_main.cpp
    int num_distance_readings;
    volatile uint32 distance_value;
    stopwatch_t distance_timer;
    int distance_delay;

    // vbat admin

    volatile uint16 vbat_reading;
    stopwatch_t vbat_timer;

    // button admin

    button_t button;
    stopwatch_t button_held_timer;

    // how many boots from standby mode since power on

    int standby_boot = 0;

    // default sleep count (@ of ~30s slots) - overriden from the server

    uint16 sleep_count = 304;

    //////////////////////////////////////////////////////////////////////

    uint32 stopwatch_t::elapsed() const
    {
        return static_cast<uint32>(static_cast<int32>(ticks) - now);
    }

    //////////////////////////////////////////////////////////////////////

    void stopwatch_t::reset()
    {
        now = ticks;
    }

    //////////////////////////////////////////////////////////////////////

    void set_state(state_t new_state)
    {
        debug("set_state [%s] (%d) after %d ticks\n", state_name[new_state], new_state, state_stopwatch.elapsed());
        state_stopwatch.reset();
        state = new_state;
    }

    //////////////////////////////////////////////////////////////////////
    // sleep for some amount of time
    //
    // 61440 / 128000 = 0.48 seconds per tick
    // 63(64?) ticks per loop = 30.24(30.72?) seconds - measured w/PPK at ~30.6 seconds (loop overhead?)
    // so to wait for 6 hours, loop count of 705 is about right (seems to be ~3 to 8 seconds shy)
    // the 128kHz LSI clock is probably not that accurate anyway...
    //
    // button wakes it up, hold for > N seconds to set factory_reset flag
    //
    // do not call this from an interrupt handler

    void sleep(uint32 count)
    {
        __disable_irq();

        payload.flags = 0;

        // switch off the ADC
        ADC1->CTLR2 = 0;

        // switch off all clocks except what we need
        RCC->AHBPCENR = RCC_AHBPeriph_SRAM;
        RCC->APB1PCENR = RCC_APB1Periph_PWR;
        RCC->APB2PCENR = RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOD | RCC_APB2Periph_AFIO;

        // disable all AFIO remap
        AFIO->PCFR1 = 0;

        // then set all GPIOs input pull down except BUTTON (A2 = pullup), LED (C0 = pull up) and 5VSW (C2 = pullup)
        GPIOA->CFGLR = 0x88888888;
        GPIOC->CFGLR = 0x88888888;
        GPIOD->CFGLR = 0x88888888;
        GPIOA->OUTDR = GPIO_MASK_BUTTON;
        GPIOC->OUTDR = GPIO_MASK_LED | GPIO_MASK_5VSW;
        GPIOD->OUTDR = 0;

        // set clock to 8MHz HSI, switch off the PLL
        RCC->CFGR0 |= RCC_HPRE_DIV3;
        RCC->CTLR &= ~RCC_PLLON;

        // switch off SysTick
        SysTick->CTLR = 0;

        // EXTI line 2 on port A (A2... right?)
        AFIO->EXTICR = GPIO_PortSourceGPIOA << GPIO_PIN_BUTTON;

        // configure EXTI_Line9 (auto wakeup) and EXTI_Line2 (button) event falling triggers
        EXTI->INTENR = 0;
        EXTI->EVENR = EXTI_Line9 | EXTI_Line2;
        EXTI->RTENR = 0;
        EXTI->FTENR = EXTI_Line9 | EXTI_Line2;

        // switch on 128kHz LSI
        RCC->RSTSCKR |= RCC_LSION;

        // wait for it to stabilize
        while((RCC->RSTSCKR & RCC_LSIRDY) == 0) {
        }

        // setup auto wakeup every ~30seconds
        PWR->AWUCSR &= ~PWR_AWUEN;
        PWR->AWUPSC = PWR_AWU_Prescaler_61440;

#if defined(DEBUG_OVERRIDE_SLEEP_COUNT)
        PWR->AWUWR = 2;
#else
        PWR->AWUWR = 63;
#endif
        PWR->AWUCSR |= PWR_AWUEN;

        // prepare standby mode
        PWR->CTLR = PWR_CTLR_PDDS;
        NVIC->SCTLR |= PFIC_SCTLR_SLEEPDEEP | PFIC_SCTLR_WFITOWFE;

        // 1st WFI seems to be ignored for some reason...? am I not clearing something? irq pending?
        asm volatile ("wfi");

        // go into standby N times for some amount of time, button wakes it up

#pragma GCC unroll 0
        for(uint32 i = count; i != 0; --i) {
            asm volatile ("wfi");
            if(GPIO_Get(GPIO_PORT_BUTTON, GPIO_MASK_BUTTON) == 0) {
                payload.ch32_flag_button_boot = 1;
                break;
            }
        }

        // disable sleep/standby stuff
        EXTI->INTENR = 0;
        EXTI->EVENR = 0;
        EXTI->RTENR = 0;
        EXTI->FTENR = 0;
        RCC->RSTSCKR &= ~RCC_LSION;
        PWR->AWUCSR &= ~PWR_AWUEN;
        PWR->CTLR &= ~PWR_CTLR_PDDS;

        // set systick to 8MHz/8000 = 1ms
        SysTick->CTLR = 0;
        SysTick->SR = 0;
        SysTick->CMP = 8000 - 1;
        SysTick->CNT = 0;
        SysTick->CTLR = SYSTICK_CTLR_ENABLE | SYSTICK_CTLR_HCLK | SYSTICK_CTLR_AUTORE;

        __enable_irq();

        SystemInit();        // reinit System Clock to 48MHz HSI

        standby_boot += 1;

        user_init();
    }

    //////////////////////////////////////////////////////////////////////

    extern "C" void SysTick_Handler(void)
    {
        SysTick->SR &= ~SYSTICK_SR_CNTIF;
        button.update(!GPIO_Get(GPIO_PORT_BUTTON, GPIO_MASK_BUTTON));
        ticks += 1;
    }

    //////////////////////////////////////////////////////////////////////

    extern "C" void ADC1_IRQHandler(void)
    {
        ADC1->STATR = ~ADC_EOC;
        vbat_reading = (uint16_t)ADC1->RDATAR;
        GPIO_Clear(GPIO_PORT_VBAT_SNS_EN, GPIO_MASK_VBAT_SNS_EN);
        vbat_status = status_complete;
    }

    //////////////////////////////////////////////////////////////////////

    extern "C" void TIM1_CC_IRQHandler(void)
    {
        if((TIM1->INTFR & TIM_IT_CC2) != 0) {
            distance_value = TIM1->CH2CVR;
            distance_status = status_complete;
            TIM1->INTFR = ~TIM_IT_CC2;
        }
        if((TIM1->INTFR & TIM_IT_CC1) != 0) {
            TIM1->INTFR = ~TIM_IT_CC1;
        }
    }

    //////////////////////////////////////////////////////////////////////

    void DMA1_Channel2_IRQHandler(void)
    {
        DMA1->INTFCR = DMA1_FLAG_TC2;
    }

    //////////////////////////////////////////////////////////////////////

    void DMA1_Channel3_IRQHandler(void)
    {
        spi_status = status_complete;
        DMA1->INTFCR = DMA1_FLAG_TC3;
        spi_start();
    }

    //////////////////////////////////////////////////////////////////////
    // UART1 for printf/getchar

    void init_uart1(void)
    {
        RCC->APB2PCENR |= RCC_APB2Periph_GPIOD | RCC_APB2Periph_USART1 | RCC_APB2Periph_AFIO;

