cskilbeck/distance_sensor/firmware/CH32V003F4P6/User/user_main.cpp
        GPIO_Setup(GPIO_PORT_TX, GPIO_PIN_TX, GPIO_OUT_AF_PP_10MHZ);

        {
            USART_InitTypeDef USART_InitStructure;
            USART_InitStructure.USART_BaudRate = 115200;
            USART_InitStructure.USART_WordLength = USART_WordLength_8b;
            USART_InitStructure.USART_StopBits = USART_StopBits_1;
            USART_InitStructure.USART_Parity = USART_Parity_No;
            USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
            USART_InitStructure.USART_Mode = USART_Mode_Tx;
            USART_Init(USART1, &USART_InitStructure);
        }

        USART1->CTLR1 |= USART_CTLR1_UE;
    }

    //////////////////////////////////////////////////////////////////////

    void flush_printf()
    {
        // wait for transfer empty and transfer complete
        uint32 constexpr flags = (USART_STATR_TC | USART_STATR_TXE);
        while((USART1->STATR & flags) != flags) {
        }
    }

    //////////////////////////////////////////////////////////////////////

    void button_t::update(int state)
    {
        held = state;
        history = (history << 1) | state;
        if(history == 0x0001) {
            pressed = 1;
        } else if(history == 0xfffe) {
            released = 1;
        }
    }

    //////////////////////////////////////////////////////////////////////

    void init_button()
    {
        RCC->APB2PCENR |= RCC_APB2Periph_GPIOA;

        GPIO_Setup(GPIO_PORT_BUTTON, GPIO_PIN_BUTTON, GPIO_IN_PULLUP_DOWN);
        GPIO_SetPullup(GPIO_PORT_BUTTON, GPIO_MASK_BUTTON);

        button.history = 0;
        button.flags = 0;
    }

    //////////////////////////////////////////////////////////////////////
    // Timer 2 channel 2 (GPIO D3) is SEND pulse

    void init_timer2()
    {
        RCC->APB1PCENR |= RCC_APB1Periph_TIM2;
        RCC->APB2PCENR |= RCC_APB2Periph_AFIO;

        TIM_Cmd(TIM2, DISABLE);

        GPIO_Setup(GPIO_PORT_SNS_TX, GPIO_PIN_SNS_TX, GPIO_OUT_AF_PP_10MHZ);

        {
            TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
            memset(&TIM_TimeBaseInitStructure, 0, sizeof(TIM_TimeBaseInitStructure));
            TIM_TimeBaseInitStructure.TIM_Period = 65535;
            TIM_TimeBaseInitStructure.TIM_Prescaler = 65535;
            TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
            TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
            TIM_TimeBaseInit(TIM2, &TIM_TimeBaseInitStructure);
        }

        {
            TIM_OCInitTypeDef TIM_OCInitStructure;
            memset(&TIM_OCInitStructure, 0, sizeof(TIM_OCInitStructure));
            TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
            TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
            TIM_OCInitStructure.TIM_Pulse = 4;
            TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
            TIM_OC2Init(TIM2, &TIM_OCInitStructure);
        }

        TIM_CtrlPWMOutputs(TIM2, ENABLE);
        TIM_OC1PreloadConfig(TIM2, TIM_OCPreload_Enable);
        TIM_ARRPreloadConfig(TIM2, ENABLE);
        TIM_SelectOnePulseMode(TIM2, TIM_OPMode_Single);
    }

    //////////////////////////////////////////////////////////////////////
    // Timer 1 channel 1 (GPIO D2) is RECEIVE (measure pulse length)

    void init_timer1()
    {
        RCC->APB2PCENR |= RCC_APB2Periph_GPIOD | RCC_APB2Periph_TIM1;

        GPIO_Setup(GPIO_PORT_SNS_RX, GPIO_PIN_SNS_RX, GPIO_IN_FLOATING);

        TIM_Cmd(TIM1, DISABLE);

        {
            TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
            TIM_TimeBaseInitStructure.TIM_Period = 0xffff;
            TIM_TimeBaseInitStructure.TIM_Prescaler = DISTANCE_TIMER_SCALE - 1;
            TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
            TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
            TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0x00;
            TIM_TimeBaseInit(TIM1, &TIM_TimeBaseInitStructure);
        }

        {
            TIM_ICInitTypeDef TIM_ICInitStructure;
            TIM_ICInitStructure.TIM_Channel = TIM_Channel_1;
            TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
            TIM_ICInitStructure.TIM_ICFilter = 0x00;
            TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
            TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
            TIM_PWMIConfig(TIM1, &TIM_ICInitStructure);
        }

        {
            NVIC_InitTypeDef NVIC_InitStructure;
            NVIC_InitStructure.NVIC_IRQChannel = TIM1_CC_IRQn;
            NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
            NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
            NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
            NVIC_Init(&NVIC_InitStructure);
        }

        TIM_SelectInputTrigger(TIM1, TIM_TS_TI1FP1);
        TIM_SelectSlaveMode(TIM1, TIM_SlaveMode_Reset);
        TIM_SelectMasterSlaveMode(TIM1, TIM_MasterSlaveMode_Enable);
    }

    //////////////////////////////////////////////////////////////////////
    // ADC Channel 1 (GPIO A1) reads VBAT

    void init_adc(void)
    {
        RCC->APB2PCENR |= RCC_APB2Periph_GPIOD
                        | RCC_APB2Periph_GPIOA
                        | RCC_APB2Periph_ADC1;

        RCC_ADCCLKConfig(RCC_PCLK2_Div8);

        GPIO_Setup(GPIO_PORT_VBAT_SNS, GPIO_PIN_VBAT_SNS, GPIO_IN_ANALOG);
        GPIO_Setup(GPIO_PORT_VBAT_SNS_EN, GPIO_PIN_VBAT_SNS_EN, GPIO_OUT_PP_10MHZ);

        {
            ADC_InitTypeDef ADC_InitStructure;
            ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
            ADC_InitStructure.ADC_ScanConvMode = DISABLE;
            ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
            ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
            ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
            ADC_InitStructure.ADC_NbrOfChannel = 1;
            ADC_Init(ADC1, &ADC_InitStructure);
        }

        ADC_Calibration_Vol(ADC1, ADC_CALVOL_50PERCENT);
        ADC_Cmd(ADC1, ENABLE);

        ADC_ResetCalibration(ADC1);
        while(ADC_GetResetCalibrationStatus(ADC1)) {
            __NOP();
        }

        ADC_StartCalibration(ADC1);
        while(ADC_GetCalibrationStatus(ADC1)) {
            __NOP();
        }

        ADC_RegularChannelConfig(ADC1, ADC_Channel_1, 1, ADC_SampleTime_241Cycles);

        ADC_ITConfig(ADC1, ADC_IT_EOC, ENABLE);
        NVIC_EnableIRQ(ADC_IRQn);
    }

    //////////////////////////////////////////////////////////////////////

    void init_systick()
    {
        SysTick->CTLR = 0;
        SysTick->SR &= ~SYSTICK_CTLR_ENABLE;
        SysTick->CMP = (SystemCoreClock / 1000) - 1;
        SysTick->CNT = 0;
        SysTick->CTLR = SYSTICK_CTLR_ENABLE | SYSTICK_CTLR_INTEN | SYSTICK_CTLR_HCLK | SYSTICK_CTLR_AUTORE;
        NVIC_EnableIRQ(SysTicK_IRQn);
        ticks = 0;
    }

    //////////////////////////////////////////////////////////////////////

    void init_spi(void)
    {
        RCC->APB2PCENR |= RCC_APB2Periph_GPIOC | RCC_APB2Periph_SPI1 | RCC_APB2Periph_AFIO;
        RCC->AHBPCENR |= RCC_AHBPeriph_DMA1;

        RCC->APB2PRSTR |= RCC_SPI1RST;
        RCC->APB2PRSTR &= ~RCC_SPI1RST;

        GPIO_Setup(GPIO_PORT_SPI_CLK, GPIO_PIN_SPI_CLK, GPIO_IN_FLOATING);
        GPIO_Setup(GPIO_PORT_SPI_MOSI, GPIO_PIN_SPI_MOSI, GPIO_IN_FLOATING);
        GPIO_Setup(GPIO_PORT_SPI_MISO, GPIO_PIN_SPI_MISO, GPIO_OUT_AF_PP_10MHZ);
        GPIO_Setup(GPIO_PORT_SPI_CS, GPIO_PIN_SPI_CS, GPIO_IN_PULLUP_DOWN);
        GPIO_SetPullup(GPIO_PORT_SPI_CS, GPIO_MASK_SPI_CS);

        SPI1->CTLR1 &= ~SPI_CTLR1_SPE;

        uint32 constexpr SPI_CTLR1_CLEAR_Mask = 0x00003040;
        uint32 constexpr DMA_CFGR_CLEAR_Mask = 0xFFFF800F;

