cskilbeck/distance_sensor/firmware/CH32V003F4P6/User/user_main.cpp
        button.released = 0;
        button.pressed = 0;

        set_state(state_read_vbat);
    }
}

//////////////////////////////////////////////////////////////////////

extern "C" int main()
{
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);

    user_init();

    while(true) {

        // regardless of state, hold button for N seconds to factory reset

        if(button.held) {

            if(button_held_timer.elapsed() > FACTORY_RESET_BUTTON_TIME_MS && payload.ch32_flag_factory_reset == 0) {

                payload.ch32_flag_factory_reset = 1;
                set_state(state_factory_reset);
            }
        } else {
            button_held_timer.reset();
        }

        uint32 elapsed = state_stopwatch.elapsed();

        switch(state)
        {
            ////////////////////////////////////////

            case state_factory_reset:
            {
                if(elapsed < 1000 || button.held) {

                    GPIO_SetTo(GPIO_PORT_LED, GPIO_MASK_LED, (elapsed >> 6) & 1);

                } else {

                    payload.flags = 0;
                    payload.ch32_flag_factory_reset = 1;
                    payload.distance = 0;
                    payload.vbat = 0;
                    payload.resolution = DISTANCE_TIMER_SCALE;
                    init_message<ch32_reading_payload_t>(&tx_msg);
                    power_set(power_off);
                    set_state(state_reboot_esp);
                }
            }
            break;

            ////////////////////////////////////////

            case state_read_vbat:
            {
                // give power 5 ms to stabilize before reading vbat
                if(vbat_status == status_idle && elapsed > VBAT_READ_DELAY_MS) {

                    // kick off vbat read
                    vbat_status = status_in_progress;
                    ADC_SoftwareStartConvCmd(ADC1, ENABLE);
                }

                // if we got a VBAT reading
                if(vbat_status == status_complete) {

                    // stuff it into the SPI payload
                    payload.vbat = vbat_reading;
                    payload.ch32_flag_got_vbat = 1;
                    vbat_status = status_idle;

                    debug("VBAT: %d (0x%04x)\n", vbat_reading, vbat_reading);

                    // switch on the 5V rail for level shifter, distance sensor
                    power_set(power_on);

                    // and distance reading
                    num_distance_readings = 0;
                    distance_timer.reset();
                    distance_status = status_idle;
                    distance_delay = SENSOR_BOOT_DELAY_MS;
                    led_on();
                    set_state(state_read_distance);
                }
            }
            break;

            ////////////////////////////////////////

            case state_read_distance:
            {
                // end led flash at start of distance reading
                if(elapsed > 0) {
                    led_off();
                }

                // if we're ready to kick off another distance reading
                if(distance_status == status_idle) {

                    if(distance_timer.elapsed() > distance_delay) {

                        distance_status = status_in_progress;
                        distance_value = 0;

                        TIM1->INTFR = 0;
                        TIM1->DMAINTENR |= TIM_IT_CC1 | TIM_IT_CC2;
                        TIM1->CTLR1 |= TIM_CEN;

                        TIM2->SWEVGR = TIM_UG;
                        TIM2->CTLR1 |= TIM_CEN;

                        distance_delay = 5;
                    }

                } else if(distance_status == status_complete) {

                    debug("DISTANCE[%d] = %d\n", num_distance_readings, distance_value);

                    num_distance_readings += 1;

                    if(distance_value != 0 && distance_value <= MAX_VALID_DISTANCE) {

                        payload.distance = distance_value;
                        payload.ch32_flag_got_distance = 1;

                    } else if(num_distance_readings < MAX_DISTANCE_TRIES) {

                        distance_timer.reset();
                        distance_status = status_idle;

                    } else {

                        payload.distance = 0;
                        payload.ch32_flag_error_reading_distance = 1;
                    }
                }

                if(elapsed > 500) {
                    payload.ch32_flag_error_reading_distance = 1;
                }

                if(payload.ch32_flag_got_distance || payload.ch32_flag_error_reading_distance) {

                    // switch off the blasted led for sure
                    led_off();

                    // finalize the spi payload
                    payload.resolution = DISTANCE_TIMER_SCALE;
                    init_message<ch32_reading_payload_t>(&tx_msg);

#if defined(DEBUG_NO_ESP)
                    set_state(state_done);
#else
                    // start listening for ESP on SPI_CS
                    set_state(state_wait_for_esp);
#endif
                }

            }
            break;

            ////////////////////////////////////////
            // don't switch on the SPI until the ESP has driven SPI CS high
            // otherwise spurious CS line shenanigans cause a headache

            case state_wait_for_esp:
            {
                if(GPIO_Get(GPIO_PORT_SPI_CS, GPIO_MASK_SPI_CS) != 0 && elapsed > 2) {

                    init_spi();
                    spi_start();
                    set_state(state_esp);

                    // ESP boot timeout, power cycle it in desperation
                } else if(elapsed > ESP_BOOT_TIMEOUT_MS) {

                    power_set(power_off);
                    set_state(state_reboot_esp);
                }
            }
            break;

