cskilbeck/distance_sensor/firmware/CH32V003F4P6/User/user_main.cpp
            ////////////////////////////////////////

            case state_reboot_esp:
            {
                if(elapsed > ESP_POWER_OFF_TIME_MS) {
                    power_set(power_on);
                    set_state(state_wait_for_esp);
                }
            }
            break;

            ////////////////////////////////////////

            case state_esp:
            {
                // SPI transaction completed
                if(spi_status == status_complete) {

                    spi_status = status_idle;

                    bool ch32_ok = check_crc32(&rx_msg);
                    bool esp_ok = (rx_payload.flags & esp_status_spi_error) == 0;

                    if(!ch32_ok) {

                        debug("RECV SPI ERROR! Resetting SPI (got %08x, expected %08x) ID %02x, LEN %02x\n",
                                        rx_msg.crc, calc_crc32(reinterpret_cast<uint8_t const *>(&rx_msg.body), sizeof(message_body_t)),
                                        rx_msg.body.ident, rx_msg.body.length);
                        init_spi();
                        spi_start();
                    }

                    else if(!esp_ok) {

                        debug("SEND SPI ERROR! Resetting SPI\n");

                    } else {

                        if((rx_payload.flags & esp_status_factory_resetting) != 0) {

                            payload.ch32_flag_factory_reset = 0;
                            init_message<ch32_reading_payload_t>(&tx_msg);
                        }

                        if((rx_payload.flags & esp_status_done) != 0) {

                            debug("ESP done: Flags: %04x, Sleep count: %d\n", rx_payload.flags, rx_payload.sleep_count);
                            set_state(state_done);
                        }
                    }
                }

                // ESP crashed or something? power cycle it after 10 seconds
                if(elapsed > ESP_CRASHED_TIMEOUT_MS) {
                    power_set(power_off);
                    set_state(state_reboot_esp);
                }
            }
            break;

            ////////////////////////////////////////

            case state_done:
            {
                if(elapsed > SLEEP_DELAY_MS && !button.held) {

                    if(rx_payload.sleep_count != 0) {
                        sleep_count = rx_payload.sleep_count;
                    } else {
                        debug("No sleep count, keeping %d\n", sleep_count);
                    }

#if defined(DEBUG_OVERRIDE_SLEEP_COUNT)
                    sleep_count = DEBUG_OVERRIDE_SLEEP_COUNT;
#endif

                    debug("DONE Sleeping for %d\n", sleep_count);
                    flush_printf();
                    power_set(power_off);
                    sleep(sleep_count);
                }
            }
            break;
        }

        // @DEBUG button puts it to sleep for ~30 seconds

#if defined(DEBUG_BUTTON_SLEEP)

        if(button.pressed) {
            stopwatch_t debounce;
            debounce.reset();
            while(debounce.elapsed() < 10) {
                if(button.held) {
                    debounce.reset();
                }
            }
            debug("BUTTON Sleeping...\n");
            flush_printf();
            sleep(1);
        }
#endif
    }
}

